<?php
/*
+----------------------------------------------------------------------
| time       2018-06-8
+----------------------------------------------------------------------
| version    4.0.1
+----------------------------------------------------------------------
| introduce  清空某一个表(会有数据备份)
+----------------------------------------------------------------------
*/
use bin\lib\MysqliData;

//定义文件访问
define('ACC',111);

//引入核心文件
require('../core/init.php');

// print_r($_SERVER);exit;
// print_r($argv);exit;
if(!isset($argv[1])){
	echo "base: no table name";
	exit;
}
$a = new MysqliData;

$a->clear();

