<?php
/*
+----------------------------------------------------------------------
| author     王杰
+----------------------------------------------------------------------
| time       2018-04-24
+----------------------------------------------------------------------
| version    4.0.1
+----------------------------------------------------------------------
| introduce  数据库配置信息，多数据操作，读写分离下个版本再写
+----------------------------------------------------------------------
*/

return [

    'host' => '127.0.0.1',  //数据库地址

    'user' => 'root',       // 数据库帐号

    'pwd' =>'root',         // 数据库密码

    'ports' =>'3306',      //数据库端口

    'db' =>'text',         //数据库表名

    'char' => 'utf8',       // 数据库字符集

    'pref' => 'j_',         // 数据库表前缀

    'main_key'=>'id',      // 数据库表主键

    'create_at'=>'create_at', // 数据库表创建数据时间字段

    'update_at'=>'update_at', // 数据库表更新数据时间字段

	'charset'=>'utf8',  // 数据库表字符编码

	'collate'=>'utf8_bin', // 数据库表字符集

];

