<?php
/*
+----------------------------------------------------------------------
| time       2018-04-24
+----------------------------------------------------------------------
| version    4.0.1
+----------------------------------------------------------------------
| introduce  错误信息
+----------------------------------------------------------------------
*/

return [

	'success'=>[100,'操作成功'],

	// 200-299 丢失信息
	'miss'=>[200,'%s丢失'],
	'miss_password'=>[201,'密码丢失'],
	'miss_choose'=>[202,'%s未选择'],

	// 300-499 错误信息
	'error'=>[300,'%s填写错误'],
	'error_service'=>[301,'%s错误'],
	'error_token'=>[302,'token错误'],
	'error_type'=>[303,'%s类型值填写不在范围'],
	'error_choose'=>[304,'%s选择错误'],
	'error_phone'=>[305,'%s请填写正确的手机号码'],
	'error_method'=>[306,'当前请求模式错误'],
	'error_sign'=>[307,'签名错误'],
	'error_auth'=>[308,'权限不足'],
	'error_text_pay'=>[309,'30分钟内无测试成功订单'],

	'error_password'=>[310,'密码错误'],
	're_password'=>[311,'重复密码错误'],

	'file_max'=>[400,'文件超过限制'],
	'file_type'=>[401,'文件类型错误'],
	'file_fail'=>[402,'文件上传失败'],

	// 500-599 其他信息
	'length'=>[500,'%s必须在%s位'],
	'between'=>[501,'%s数字必须在%s之间'],

	// 600-699 第三方错误
	'wx_login'=>[600,'微信官方返回错误'],
	'ali_error'=>[601,'支付接口有问题，请联系管理员'],

	// 700-700 业务错误
	'manage_error'=>[700,'商户类型为代理商则不能再选择代理商'],
	'proports_error'=>[701,'当前设置的商户费率不能低于代理商费率'],
	'phone_exist'=>[702,'当前手机号已经存在'],
	'phone_code'=>[703,'短信未验证，5分钟有效'],
	'phone_http'=>[704,'短信接口出问题了'],
	'money_less'=>[705,'提现金额大于余额'],
	'aggent_miss'=>[706,'提现账号不存在'],
	'phone_code_error'=>[707,'短信验证码错误'],
	'user_frozen'=>[708,'当前用户被冻结，请联系管理员'],
	'total_fee_error'=>[709,'金额不能低于1元'],
	'user_shop_id_error'=>[710,'商户ID错误'],
	'sign_error'=>[711,'加签失败'],
	'total_fee_max'=>[712,'金额不能高于%s元'],
	'bank_error'=>[713,'接口异常请联系管理员'],
	'notify_url_error'=>[714,'回调地址不能多于%s个字符串'],
	'out_trade_no_error'=>[715,'订单编号不能多于%s个字符串'],
	'phone_api_error'=>[716,'短信接口错误'],
	'money_more'=>[717,'每笔提现金额不能超过5万'],
	'total_is_int'=>[718,'金额必须为整数'],

	'no_ali_account'=>[750,'当前无可用阿里云账号'],
	'out_trade_no_haved'=>[751,'订单编号重复'],
];

